In [94]:
import warnings
warnings.filterwarnings("ignore")

In [95]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [96]:
calls = pd.read_csv('datasets/megaline_calls.csv')

In [97]:
messages = pd.read_csv('datasets/megaline_messages.csv')

In [98]:
internet = pd.read_csv('datasets/megaline_internet.csv')

In [99]:
users = pd.read_csv('datasets/megaline_users1.csv')

In [100]:
plans = pd.read_csv('datasets/megaline_plans.csv')

In [101]:
calls.head()

         id  user_id   call_date  duration
0   1000_93     1000  2018-12-27      8.52
1  1000_145     1000  2018-12-27     13.66
2  1000_247     1000  2018-12-27     14.48
3  1000_309     1000  2018-12-28      5.76
4  1000_380     1000  2018-12-30      4.22

In [102]:
calls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 137735 entries, 0 to 137734
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   id         137735 non-null  object
 1   user_id    137735 non-null  int64
 2   call_date  137735 non-null  object
 3   duration   137735 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 4.2+ MB

In [103]:
messages.head()

         id  user_id message_date
0  1000_125     1000   2018-12-27
1  1000_160     1000   2018-12-31
2  1000_223     1000   2018-12-31
3  1000_251     1000   2018-12-27
4  1000_255     1000   2018-12-26

In [104]:
messages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76051 entries, 0 to 76050
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            76051 non-null  object
 1   user_id       76051 non-null  int64
 2   message_date  76051 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [105]:
internet.head()

         id  user_id session_date  mb_used
0   1000_13     1000   2018-12-29    89.86
1  1000_204     1000   2018-12-31     0.00
2  1000_379     1000   2018-12-28   660.40
3  1000_413     1000   2018-12-26   270.99
4  1000_442     1000   2018-12-27   880.22

In [106]:
internet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104825 entries, 0 to 104824
Data columns (total 4 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            104825 non-null  object
 1   user_id       104825 non-null  int64
 2   session_date  104825 non-null  object
 3   mb_used       104825 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 3.2+ MB

In [107]:
users.head()

,user_id,first_name,last_name,age,city,reg_date,plan,churn_date
0,1000,Anamaria,Bauer,45,"Atlanta-Sandy Springs-Roswell, GA MSA",2018-12-24,ultimate,NaN
1,1001,Mickey,Wilkerson,28,"Seattle-Tacoma-Bellevue, WA MSA",2018-08-13,surf,NaN
2,1002,Carlee,Hoffman,36,"Las Vegas-Henderson-Paradise, NV MSA",2018-10-21,surf,NaN
3,1003,Reynaldo,Jenkins,52,"Tulsa, OK MSA",2018-01-28,surf,NaN
4,1004,Leonila,Thompson,40,"Seattle-Tacoma-Bellevue, WA MSA",2018-05-23,surf,NaN

In [108]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     500 non-null    int64
 1   first_name  500 non-null    object
 2   last_name   500 non-null    object
 3   age         500 non-null    int64
 4   city        500 non-null    object
 5   reg_date    500 non-null    object
 6   plan        500 non-null    object
 7   churn_date  34 non-null     object
dtypes: int64(2), object(6)
memory usage: 31.4+ KB

In [109]:
plans.head()

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate

In [110]:
plans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   messages_included      2 non-null      int64
 1   mb_per_month_included  2 non-null      int64
 2   minutes_included       2 non-null      int64
 3   usd_monthly_pay        2 non-null      int64
 4   usd_per_gb             2 non-null      int64
 5   usd_per_message        2 non-null      float64
 6   usd_per_minute         2 non-null      float64
 7   plan_name              2 non-null      object
dtypes: float64(2), int64(5), object(1)
memory usage: 256.0+ bytes

In [111]:
#merge columns into users or join
#user_id, city, plan, call_date, duration, message_date, session_date, mb_used

In [112]:
data = users[['user_id', 'city', 'plan']]

In [113]:
data_calls = data.merge(calls, how='outer', on='user_id')

In [114]:
data_calls.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 137754 entries, 0 to 137753
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user_id    137754 non-null  int64
 1   city       137754 non-null  object
 2   plan       137754 non-null  object
 3   id         137735 non-null  object
 4   call_date  137735 non-null  object
 5   duration   137735 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 7.4+ MB

In [115]:
data_messages = data.merge(messages, how='outer', on='user_id')

In [116]:
data_messages.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 76149 entries, 0 to 76148
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   user_id       76149 non-null  int64
 1   city          76149 non-null  object
 2   plan          76149 non-null  object
 3   id            76051 non-null  object
 4   message_date  76051 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.5+ MB

In [117]:
data_internet = data.merge(internet, how='outer', on='user_id')

In [118]:
data_internet.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104836 entries, 0 to 104835
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       104836 non-null  int64
 1   city          104836 non-null  object
 2   plan          104836 non-null  object
 3   id            104825 non-null  object
 4   session_date  104825 non-null  object
 5   mb_used       104825 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 5.6+ MB

In [119]:
#fill in missing values

In [120]:
data_calls.isnull().sum()

user_id       0
city          0
plan          0
id           19
call_date    19
duration     19
dtype: int64

In [121]:
#data_calls.loc[data_calls.duration.isnull()].head()

In [122]:
data_calls['id'] = data_calls['id'].fillna(value=0)
data_calls['call_date'] = data_calls['call_date'].fillna(method='ffill')
# to have a date during conversion
data_calls['duration'] = data_calls['duration'].fillna(value=0)

In [123]:
data_messages.isnull().sum()

user_id          0
city             0
plan             0
id              98
message_date    98
dtype: int64

In [124]:
#data_messages.loc[data_messages.message_date.isnull()].head()

In [125]:
data_messages['id'] = data_messages['id'].fillna(value=0)
data_messages['message_date'] = data_messages['message_date'].fillna(method='ffill')

In [126]:
data_internet.isnull().sum()

user_id          0
city             0
plan             0
id              11
session_date    11
mb_used         11
dtype: int64

In [127]:
#data_internet.loc[data_internet.id.isnull()].head()

In [128]:
data_internet['id'] = data_internet['id'].fillna(value=0)
data_internet['session_date'] = data_internet['session_date'].fillna(method='ffill')
data_internet['mb_used'] = data_internet['mb_used'].fillna(value=0)

In [129]:
#convert data types

In [130]:
data_calls['call_date'] = pd.to_datetime(data_calls['call_date'], format='%Y-%m-%d')
data_messages['message_date'] = pd.to_datetime(data_messages['message_date'], format='%Y-%m-%d')
data_internet['session_date'] = pd.to_datetime(data_internet['session_date'], format='%Y-%m-%d')

In [131]:
#check for duplicates

In [134]:
data_calls.duplicated().sum()
data_messages.duplicated().sum()
data_internet.duplicated().sum()

0

In [135]:
#check for errors

In [139]:
data_calls.query('duration == -1')

Empty DataFrame
Columns: [user_id, city, plan, id, call_date, duration]
Index: []

In [140]:
data_internet.query('mb_used == -1')

Empty DataFrame
Columns: [user_id, city, plan, id, session_date, mb_used]
Index: []

In [141]:
#number of calls made per month

In [151]:
data_calls.sample(5)

,user_id,city,plan,id,call_date,duration,month,count
120264,1418,"New York-Newark-Jersey City, NY-NJ-PA MSA",surf,1418_131,2018-08-27,13.33,8,1
104988,1369,"Milwaukee-Waukesha, WI MSA",surf,1369_57,2018-12-01,0.00,12,1
104322,1367,"Baltimore-Columbia-Towson, MD MSA",surf,1367_187,2018-10-09,5.07,10,1
133825,1485,"Nashville-Davidson–Murfreesboro–Franklin, TN MSA",surf,1485_13,2018-12-31,1.19,12,1
3289,1011,"Cleveland-Elyria, OH MSA",ultimate,1011_142,2018-06-23,11.74,6,1

In [143]:
data_calls['month'] = data_calls['call_date'].dt.month

In [150]:
data_calls['count'] = 1

In [156]:
calls_month = (data_calls
               .pivot_table(index='user_id', values='count', columns='month', aggfunc='count')
                .fillna(value=0)
)

In [157]:
calls_month.head()

month     1    2    3    4     5     6     7     8     9     10    11     12
user_id
1000     0.0  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   16.0
1001     0.0  0.0  0.0  0.0   0.0   0.0   0.0  27.0  49.0  65.0  64.0   56.0
1002     0.0  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0  11.0  55.0   47.0
1003     0.0  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0  149.0
1004     0.0  0.0  0.0  0.0  21.0  44.0  49.0  49.0  42.0  61.0  54.0   50.0

In [158]:
#minutes used per month

In [195]:
minutes_month = (data_calls
                 .pivot_table(index=['user_id', 'plan'], values='duration', columns=['month'], aggfunc='sum')
                .fillna(value=0)
)

In [198]:
minutes_month.head()

,month,1,2,3,4,5,6,7,8,9,10,11,12
user_id,plan,,,,,,,,,,,,
1000,ultimate,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,116.83
1001,surf,0.0,0.0,0.0,0.0,0.00,0.00,0.00,171.14,297.69,374.11,404.59,392.93
1002,surf,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,54.13,359.76,363.24
1003,surf,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,1041.00
1004,surf,0.0,0.0,0.0,0.0,181.58,261.32,358.45,334.86,284.60,341.63,452.98,403.53

In [161]:
#messages per month

In [168]:
data_messages.head()

,user_id,city,plan,id,message_date,count,month
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_125,2018-12-27,1,12
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_160,2018-12-31,1,12
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_223,2018-12-31,1,12
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_251,2018-12-27,1,12
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_255,2018-12-26,1,12

In [167]:
data_messages['count'] = 1
data_messages['month'] = data_messages['message_date'].dt.month

In [170]:
msg_month = (data_messages
             .pivot_table(index='user_id', values='count', columns='month', aggfunc='sum')
             .fillna(value=0)
)

In [171]:
msg_month.head()

month     1    2    3    4    5     6     7     8     9     10    11    12
user_id
1000     0.0  0.0  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0   0.0  11.0
1001     0.0  0.0  0.0  0.0  0.0   0.0   0.0  30.0  44.0  53.0  36.0  44.0
1002     0.0  0.0  0.0  0.0  0.0   0.0   0.0   0.0   0.0  15.0  32.0  41.0
1003     0.0  0.0  0.0  0.0  0.0   0.0   0.0   0.0   0.0   0.0   0.0  50.0
1004     0.0  0.0  0.0  0.0  7.0  18.0  26.0  25.0  21.0  24.0  25.0  31.0

In [172]:
#data per month

In [175]:
data_internet.head()

,user_id,city,plan,id,session_date,mb_used,month
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_13,2018-12-29,89.86,12
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_204,2018-12-31,0.00,12
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_379,2018-12-28,660.40,12
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_413,2018-12-26,270.99,12
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_442,2018-12-27,880.22,12

In [174]:
data_internet['month'] = data_internet.session_date.dt.month

In [182]:
mb_month = (data_internet
            .pivot_table(index='user_id', values='mb_used', columns='month', aggfunc='sum')
            .fillna(value=0)
)

In [183]:
mb_month.head()

month,1,2,3,4,5,6,7,8,9,10,11,12
user_id,,,,,,,,,,,,
1000,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,1901.47
1001,0.0,0.0,0.0,0.0,0.00,0.00,0.00,6919.15,13314.82,22330.49,18504.30,19369.18
1002,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,6552.01,19345.08,14396.24
1003,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,27044.14
1004,0.0,0.0,0.0,0.0,6547.21,20672.82,24516.62,27981.74,18852.72,14541.63,21850.78,21389.29

In [184]:
#monthly profit from each user

In [199]:
minutes_month.head()

,month,1,2,3,4,5,6,7,8,9,10,11,12
user_id,plan,,,,,,,,,,,,
1000,ultimate,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,116.83
1001,surf,0.0,0.0,0.0,0.0,0.00,0.00,0.00,171.14,297.69,374.11,404.59,392.93
1002,surf,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,54.13,359.76,363.24
1003,surf,0.0,0.0,0.0,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,1041.00
1004,surf,0.0,0.0,0.0,0.0,181.58,261.32,358.45,334.86,284.60,341.63,452.98,403.53

In [200]:
plans

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate